Revit 2027 API
BuiltInFailures.MEPCalculationFailures.HydraulicSeparationAmbiguity Property
 Unable to hydraulically separate until the system has flow.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId HydraulicSeparationAmbiguity { get; }
Public Shared ReadOnly Property HydraulicSeparationAmbiguity As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ HydraulicSeparationAmbiguity {
	FailureDefinitionId^ get ();
}
static member HydraulicSeparationAmbiguity : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace